In [1]:
## import libraries
import pandas as pd
import numpy as np

In [2]:
## create mock demo data
df = pd.DataFrame({
    "col_A": np.arange(1,20,2),
"col_B": np.arange(21,40,2)},
    index=["F", "Z", "C", "D", "A", "K", "X", "G", "B", "Q"])

df

   col_A  col_B
F      1     21
Z      3     23
C      5     25
D      7     27
A      9     29
K     11     31
X     13     33
G     15     35
B     17     37
Q     19     39

## ```.iloc```

Access df data by integer-location based indexing for selection by position

```df.iloc[start_index:end_index]``` returns a slice of the data based on positional values

In [5]:
## return what's in position zero to 4
df.iloc[0:4]

   col_A  col_B
F      1     21
Z      3     23
C      5     25
D      7     27

In [7]:
## double brackets
# df.iloc[5]
df.iloc[[5]]

   col_A  col_B
K     11     31

## ```.loc```

Access a group of rows and columns by label(s)

```df.loc[[index_value1, index_value3, index_value4]]``` returns values at those index positions.

In [10]:
## use loc to get values for index F, C, K and X
df.loc[["F", "K", "X", "D"]]

   col_A  col_B
F      1     21
K     11     31
X     13     33
D      7     27

In [11]:
## recall our df
df

   col_A  col_B
F      1     21
Z      3     23
C      5     25
D      7     27
A      9     29
K     11     31
X     13     33
G     15     35
B     17     37
Q     19     39

```df.iat[index_value]``` returns value at that position

In [20]:
## what's the first value in col_A
df["col_A"].iat[0]

1

In [27]:
## calling iloc on the zero position returns:
df.iloc[0]

col_A     1
col_B    21
Name: F, dtype: int64

In [29]:
## to get the first value in the first col:
df.iloc[0][0]

1

In [32]:
df.loc["K"]

col_A    11
col_B    31
Name: K, dtype: int64

```df["col_name"].iat(position)``` is considered faster than using ```iloc``` to return a single value.


You can also use numbers instead of column names
```df.iat[row_number, col_number]```

In [35]:
df["col_A"].iat[5]

11

In [37]:
## can also use numbers instead of column names
df.iat[0,0]

1

## ```df.at``` to fill in missing values

In [45]:
## create new df with a few missing values
df = pd.DataFrame([[0, 2, np.nan], [0, np.nan, 1], [np.nan, 20, 30]],
                  columns=['A', 'B', 'C'])
df

     A     B     C
0  0.0   2.0   NaN
1  0.0   NaN   1.0
2  NaN  20.0  30.0

We call the researcher who put this dataset to inquire about the missing values.

They tell us that ```0, C``` is 3.1; ```1, B``` is 4.5 and ```2, A``` is 6.9.

In [46]:
## fill in 0,C with 3.1
df.at[0, "C"] = 3.1
df

     A     B     C
0  0.0   2.0   3.1
1  0.0   NaN   1.0
2  NaN  20.0  30.0

In [47]:
## fill in 1,B with 4.5
df.at[1, "B"] = 4.5
df

     A     B     C
0  0.0   2.0   3.1
1  0.0   4.5   1.0
2  NaN  20.0  30.0

In [48]:
## fill in 2,A with 6.9
df.at[2, "A"] = 6.9
df

     A     B     C
0  0.0   2.0   3.1
1  0.0   4.5   1.0
2  6.9  20.0  30.0